bolknote/MK61S_MINI/code/rtc_clock.cpp
#include "rtc_clock.hpp"

#include <STM32RTC.h>
#include <backup.h>

#include "config.h"
#include "crash_dump.hpp"
#include "debug.h"
#include "power_monitor.hpp"
#include "stm32f4_platform_resources.hpp"

#if MK61_STM32F4_RESOURCE_MAP_SUPPORTED && defined(TIM5) && \
    defined(TIM_OR_TI4_RMP) && defined(TIM_OR_TI4_RMP_0) && \
    defined(TIM_CCMR2_CC4S_0) && defined(TIM_CCMR2_IC4PSC)
  #define MK61_RTC_TIM5_LSI_CAPTURE 1
#else
  #define MK61_RTC_TIM5_LSI_CAPTURE 0
#endif

namespace rtc_clock {
namespace {

// DR1 зарезервирован соглашениями RTC ядра STM32, DR4/DR10 — текущим и старым
// HID-загрузчиком. DR2 хранит признак установленного времени, DR3 — поправку
// хода. Версионированная запись проекта занимает только DR11..DR19.
static constexpr u32 TIME_SET_MARKER = 0x4D4B5254UL; // "MKRT"
static bool initialized = false;
static bool metadata_valid_at_boot = false;
static volatile u32 pending_alarm_irqs = 0;
static u8 pending_alarm_events = 0;
static u8 missed_alarm_events = 0;
static u8 alarm_arm_failures = 0;

#if defined(RTC_BKP_NUMBER)
static_assert(RTC_BKP_NUMBER >= 20,
              "F401/F411 RTC metadata requires DR0..DR19");
#endif
static_assert(rtc_backup_layout::FIRST_REGISTER == 11 &&
              rtc_backup_layout::LAST_REGISTER == 19,
              "RTC backup window must remain DR11..DR19");

struct PreservedBackupState {
  bool time_was_set;
  bool calibration_was_set;
  u32 calibration_record;
  bool metadata_was_valid;
  rtc_backup_layout::Words metadata_words;
};

#if defined(LSE_STARTUP_TIMEOUT)
static constexpr u32 LSE_TIMEOUT_MS = LSE_STARTUP_TIMEOUT;
#else
static constexpr u32 LSE_TIMEOUT_MS = 5000;
#endif
static constexpr u32 LSE_STOP_TIMEOUT_MS = 100;
static constexpr u32 LSI_START_TIMEOUT_MS = 100;
static constexpr u32 LSI_CAPTURE_TIMEOUT_MS = 50;
static constexpr u32 LSI_CAPTURE_DIVIDER = 8;
static constexpr u32 LSI_CAPTURE_INTERVALS = 16;
static constexpr u32 LSI_CAPTURE_CYCLES =
    LSI_CAPTURE_DIVIDER * LSI_CAPTURE_INTERVALS;
static constexpr u32 LSI_MIN_PLAUSIBLE_HZ = 10000;
static constexpr u32 LSI_MAX_PLAUSIBLE_HZ = 60000;

STM32RTC& hardware_rtc(void) {
  return STM32RTC::getInstance();
}

RTC_HandleTypeDef* rtc_handle(void) {
  return hardware_rtc().getHandle();
}

bool marker_is_set(void) {
  return HAL_RTCEx_BKUPRead(rtc_handle(), RTC_BKP_DR2) == TIME_SET_MARKER;
}

u32 backup_register_before_rtc_begin(u32 index) {
  // Обычная переменная RAM переживёт сброс только резервного домена, который
  // STM32RTC выполняет внутри begin() при смене источника LSE/LSI.
  enableBackupDomain();
  return getBackupRegister(index);
}

void write_backup_register(u32 index, u32 value) {
  // Повторный вызов соответствует вспомогательной функции домена резервного
  // питания ядра STM32 и гарантирует, что запись DBP прошла через мост APB/AHB
  // до записи в резервный регистр.
  HAL_PWR_EnableBkUpAccess();
  HAL_PWR_EnableBkUpAccess();
  HAL_RTCEx_BKUPWrite(rtc_handle(), index, value);
}

void write_marker(u32 value) {
  write_backup_register(RTC_BKP_DR2, value);
}

rtc_backup_layout::Words read_metadata_words(void) {
  rtc_backup_layout::Words words = {};
  for(u8 index = 0; index < rtc_backup_layout::WORD_COUNT; index++) {
    words.value[index] = HAL_RTCEx_BKUPRead(
        rtc_handle(), rtc_backup_layout::FIRST_REGISTER + index);
  }
  return words;
}

rtc_backup_layout::Words read_metadata_words_before_rtc_begin(void) {
  rtc_backup_layout::Words words = {};
  for(u8 index = 0; index < rtc_backup_layout::WORD_COUNT; index++) {
    words.value[index] = backup_register_before_rtc_begin(
        rtc_backup_layout::FIRST_REGISTER + index);
  }
  return words;
}

bool read_metadata(rtc_backup_layout::Metadata& out) {
  return rtc_backup_layout::decode(read_metadata_words(), out);
}

bool write_metadata(const rtc_backup_layout::Metadata& metadata) {
  rtc_backup_layout::Words words = {};
  if(!rtc_backup_layout::encode(metadata, words)) return false;

  // Transactional commit in retention registers: invalidate first, write the
  // whole body/checksum, then publish the versioned header last. A reset or
  // power loss at any intermediate point leaves a record that decode rejects.
  write_backup_register(rtc_backup_layout::FIRST_REGISTER +
                        rtc_backup_layout::WORD_HEADER, 0);
  for(u8 index = 1; index < rtc_backup_layout::WORD_COUNT; index++) {
    write_backup_register(rtc_backup_layout::FIRST_REGISTER + index,
                          words.value[index]);
  }
  write_backup_register(rtc_backup_layout::FIRST_REGISTER +
                        rtc_backup_layout::WORD_HEADER,
                        words.value[rtc_backup_layout::WORD_HEADER]);

  const rtc_backup_layout::Words verified = read_metadata_words();
  for(u8 index = 0; index < rtc_backup_layout::WORD_COUNT; index++) {
    if(verified.value[index] != words.value[index]) return false;
  }
  return true;
}

void restore_metadata_words(const rtc_backup_layout::Words& words) {
  write_backup_register(rtc_backup_layout::FIRST_REGISTER +
                        rtc_backup_layout::WORD_HEADER, 0);
  for(u8 index = 1; index < rtc_backup_layout::WORD_COUNT; index++) {
    write_backup_register(rtc_backup_layout::FIRST_REGISTER + index,
                          words.value[index]);
  }
  write_backup_register(rtc_backup_layout::FIRST_REGISTER +
                        rtc_backup_layout::WORD_HEADER,
                        words.value[rtc_backup_layout::WORD_HEADER]);
}

PreservedBackupState preserve_backup_state(void) {
  const bool time_was_set =
      backup_register_before_rtc_begin(LL_RTC_BKP_DR2) == TIME_SET_MARKER;
  const u32 calibration_record =
      backup_register_before_rtc_begin(LL_RTC_BKP_DR3);
  i16 calibration = 0;
  const bool calibration_was_set =
      decode_calibration_record(calibration_record, calibration);
  const rtc_backup_layout::Words metadata_words =
      read_metadata_words_before_rtc_begin();
  rtc_backup_layout::Metadata metadata = {};
  const bool metadata_was_valid =
      rtc_backup_layout::decode(metadata_words, metadata);
  return {time_was_set, calibration_was_set, calibration_record,
          metadata_was_valid, metadata_words};
}

void restore_backup_state(const PreservedBackupState& state) {
  if(state.time_was_set && !marker_is_set()) {
    // При смене RTCSEL библиотека возвращает календарь после сброса резервного
    // домена, но пользовательские backup-регистры не восстанавливает.
    write_marker(TIME_SET_MARKER);
    dbgln(SPIROM, "RTC init: restored time-set marker after source change");
  }

  if(state.calibration_was_set &&
     HAL_RTCEx_BKUPRead(rtc_handle(), RTC_BKP_DR3) !=
       state.calibration_record) {
    write_backup_register(RTC_BKP_DR3, state.calibration_record);
    dbgln(SPIROM, "RTC init: restored calibration after source change");
  }

