bolknote/MK61S_MINI/code/rtc_clock.cpp
  rtc_backup_layout::Metadata current = {};
  if(state.metadata_was_valid && !read_metadata(current)) {
    restore_metadata_words(state.metadata_words);
    dbgln(SPIROM, "RTC init: restored metadata after source change");
  }
}

i16 stored_calibration_ppm(void) {
  i16 ppm = 0;
  const u32 record = HAL_RTCEx_BKUPRead(rtc_handle(), RTC_BKP_DR3);
  return decode_calibration_record(record, ppm) ? ppm : 0;
}

bool apply_smooth_calibration(i16 ppm) {
  SmoothCalibration calibration = {};
  if(!smooth_calibration_for_ppm(ppm, calibration)) return false;

  const u32 plus = calibration.plus_512_pulses
      ? RTC_SMOOTHCALIB_PLUSPULSES_SET
      : RTC_SMOOTHCALIB_PLUSPULSES_RESET;
  const u32 desired = plus | calibration.minus_pulses;
  const u32 mask = RTC_CALR_CALP | RTC_CALR_CALW8 |
                   RTC_CALR_CALW16 | RTC_CALR_CALM;
  if((rtc_handle()->Instance->CALR & mask) == desired) return true;

  return HAL_RTCEx_SetSmoothCalib(
      rtc_handle(), RTC_SMOOTHCALIB_PERIOD_32SEC, plus,
      calibration.minus_pulses) == HAL_OK;
}

u8 alarm_index(rtc_backup_layout::AlarmId id) {
  return id == rtc_backup_layout::AlarmId::B ? 1 : 0;
}

u32 alarm_event_bit(rtc_backup_layout::AlarmId id) {
  return 1UL << alarm_index(id);
}

u32 hardware_alarm_id(rtc_backup_layout::AlarmId id) {
#if defined(RTC_ALARM_B)
  return id == rtc_backup_layout::AlarmId::B ? RTC_ALARM_B : RTC_ALARM_A;
#else
  return id == rtc_backup_layout::AlarmId::A ? RTC_ALARM_A : 0xFFFFFFFFUL;
#endif
}

void alarm_a_callback(void*) {
  __atomic_fetch_or(&pending_alarm_irqs,
                    alarm_event_bit(rtc_backup_layout::AlarmId::A),
                    __ATOMIC_RELEASE);
}

#if defined(RTC_ALARM_B)
void alarm_b_callback(void*) {
  __atomic_fetch_or(&pending_alarm_irqs,
                    alarm_event_bit(rtc_backup_layout::AlarmId::B),
                    __ATOMIC_RELEASE);
}
#endif

void increment_alarm_arm_failures(void) {
  if(alarm_arm_failures != 0xFFU) alarm_arm_failures++;
}

bool disable_hardware_alarm(rtc_backup_layout::AlarmId id) {
  const u32 hardware_id = hardware_alarm_id(id);
  if(hardware_id == 0xFFFFFFFFUL) return false;
  return HAL_RTC_DeactivateAlarm(rtc_handle(), hardware_id) == HAL_OK;
}

bool arm_hardware_alarm(rtc_backup_layout::AlarmId id,
                        const rtc_backup_layout::Alarm& alarm) {
  if(!rtc_backup_layout::valid_alarm(alarm)) return false;
  if(!alarm.enabled) return disable_hardware_alarm(id);
  const u32 hardware_id = hardware_alarm_id(id);
  if(hardware_id == 0xFFFFFFFFUL) return false;

  (void) HAL_RTC_DeactivateAlarm(rtc_handle(), hardware_id);
  RTC_AlarmTypeDef value = {};
  value.AlarmTime.Hours = alarm.when.hour;
  value.AlarmTime.Minutes = alarm.when.minute;
  value.AlarmTime.Seconds = alarm.when.second;
  value.AlarmTime.TimeFormat = RTC_HOURFORMAT12_AM;
  value.AlarmTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
  value.AlarmTime.StoreOperation = RTC_STOREOPERATION_RESET;
  value.AlarmMask = alarm.repeat == rtc_backup_layout::Repeat::DAILY
      ? RTC_ALARMMASK_DATEWEEKDAY : RTC_ALARMMASK_NONE;
  if(alarm.millisecond == rtc_backup_layout::MILLISECOND_IGNORED) {
    value.AlarmTime.SubSeconds = 0;
    value.AlarmSubSecondMask = RTC_ALARMSUBSECONDMASK_ALL;
  } else {
    const u32 fraction = rtc_handle()->Instance->PRER & RTC_PRER_PREDIV_S;
    u32 significant_bits = 0;
    for(u32 bits = fraction; bits != 0; bits >>= 1) significant_bits++;
    if(significant_bits == 0 || significant_bits > 15) return false;
    value.AlarmTime.SubSeconds = fraction -
        ((u32) alarm.millisecond * (fraction + 1U)) / 1000U;
    value.AlarmSubSecondMask =
        significant_bits << RTC_ALRMASSR_MASKSS_Pos;
  }
  value.AlarmDateWeekDay = alarm.repeat == rtc_backup_layout::Repeat::DAILY
      ? 1 : alarm.when.day;
  value.AlarmDateWeekDaySel = RTC_ALARMDATEWEEKDAYSEL_DATE;
  value.Alarm = hardware_id;
  if(HAL_RTC_SetAlarm_IT(rtc_handle(), &value, RTC_FORMAT_BIN) != HAL_OK) {
    return false;
  }
  HAL_NVIC_SetPriority(RTC_Alarm_IRQn, RTC_IRQ_PRIO, RTC_IRQ_SUBPRIO);
  HAL_NVIC_EnableIRQ(RTC_Alarm_IRQn);
  return true;
}

void attach_alarm_callbacks(void) {
  STM32RTC& rtc = hardware_rtc();
  rtc.attachInterrupt(alarm_a_callback, nullptr, STM32RTC::ALARM_A);
#if defined(RTC_ALARM_B)
  rtc.attachInterrupt(alarm_b_callback, nullptr, STM32RTC::ALARM_B);
#endif
}

i8 compare_snapshot_to_alarm(const StartupSnapshot& snapshot,
                             const rtc_backup_layout::Alarm& alarm) {
  const i8 calendar = rtc_backup_layout::compare(
      snapshot.date_time, alarm.when);
  if(calendar != 0 ||
     alarm.millisecond == rtc_backup_layout::MILLISECOND_IGNORED) {
    return calendar;
  }
  const u16 current = snapshot_milliseconds(snapshot);
  if(current == alarm.millisecond) return 0;
  return current < alarm.millisecond ? -1 : 1;
}

bool restore_scheduled_alarms(rtc_backup_layout::Metadata& metadata,
                              bool report_missed) {
  StartupSnapshot snapshot = {};
  if(!marker_is_set() || !startup_snapshot(snapshot) || !snapshot.time_set) {
    (void) disable_hardware_alarm(rtc_backup_layout::AlarmId::A);
    (void) disable_hardware_alarm(rtc_backup_layout::AlarmId::B);
    return true;
  }

  bool metadata_changed = false;
  bool hardware_ok = true;
  u8 restored_missed = 0;
  for(u8 index = 0; index < 2; index++) {
    const rtc_backup_layout::AlarmId id = index == 0
        ? rtc_backup_layout::AlarmId::A : rtc_backup_layout::AlarmId::B;
    rtc_backup_layout::Alarm& alarm = metadata.alarms[index];
    if(!alarm.enabled) {
      (void) disable_hardware_alarm(id);
      continue;
    }
    if(alarm.repeat == rtc_backup_layout::Repeat::ONE_SHOT &&
       compare_snapshot_to_alarm(snapshot, alarm) >= 0) {
      (void) disable_hardware_alarm(id);
      alarm = rtc_backup_layout::disabled_alarm();
      metadata_changed = true;
      if(report_missed) {
        const u8 bit = (u8) alarm_event_bit(id);
        pending_alarm_events |= bit;
        missed_alarm_events |= bit;
        restored_missed |= bit;
      }
      continue;
    }
    if(!arm_hardware_alarm(id, alarm)) {
      increment_alarm_arm_failures();
      hardware_ok = false;
    }
  }
  if(restored_missed != 0) {
    metadata.last_wake = restored_missed == 1
        ? rtc_backup_layout::WakeReason::MISSED_A
        : (restored_missed == 2
            ? rtc_backup_layout::WakeReason::MISSED_B
            : rtc_backup_layout::WakeReason::MISSED_BOTH);
  }
  const bool metadata_ok = !metadata_changed || write_metadata(metadata);
  return hardware_ok && metadata_ok;
}

void initialize_metadata(const PreservedBackupState& preserved) {
  metadata_valid_at_boot = preserved.metadata_was_valid;
  rtc_backup_layout::Metadata metadata = {};
  if(!read_metadata(metadata)) metadata = rtc_backup_layout::empty_metadata();
  metadata.boot_count = rtc_backup_layout::increment_saturated(
      metadata.boot_count);
  metadata.reset_flags = crash_dump::boot_reset_flags();
  metadata.last_wake = rtc_backup_layout::WakeReason::RESET;
  metadata.previous_power_unstable =
      power_monitor::snapshot().previous_unstable;
  if(!write_metadata(metadata)) {
    dbgln(SPIROM, "RTC metadata: write verification failed");
  }
  attach_alarm_callbacks();
  if(!restore_scheduled_alarms(metadata, true)) {
    dbgln(SPIROM, "RTC metadata: alarm restore failed");
  }
}

bool wait_for_lse_flag(bool ready, u32 timeout_ms) {
  const u32 started_ms = millis();
  while((__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) != RESET) != ready) {
    if((u32) (millis() - started_ms) >= timeout_ms) return false;
    yield();
  }
  return true;
}

