bolknote/MK61S_MINI/code/rtc_clock.cpp
bool start_lsi_for_measurement(void) {
  __HAL_RCC_LSI_ENABLE();
  const u32 started_ms = millis();
  while(__HAL_RCC_GET_FLAG(RCC_FLAG_LSIRDY) == RESET) {
    if((u32) (millis() - started_ms) >= LSI_START_TIMEOUT_MS) {
      return false;
    }
    yield();
  }
  return true;
}

#if MK61_RTC_TIM5_LSI_CAPTURE

struct Tim5State {
  bool clock_was_enabled;
  u32 cr1;
  u32 cr2;
  u32 smcr;
  u32 dier;
  u32 sr;
  u32 ccmr1;
  u32 ccmr2;
  u32 ccer;
  u32 cnt;
  u32 psc;
  u32 arr;
  u32 ccr1;
  u32 ccr2;
  u32 ccr3;
  u32 ccr4;
  u32 dcr;
  u32 dmar;
  u32 option_register;
};

Tim5State save_tim5_state(void) {
  Tim5State state = {};
  state.clock_was_enabled = __HAL_RCC_TIM5_IS_CLK_ENABLED();
  if(!state.clock_was_enabled) __HAL_RCC_TIM5_CLK_ENABLE();
  state.cr1 = TIM5->CR1;
  state.cr2 = TIM5->CR2;
  state.smcr = TIM5->SMCR;
  state.dier = TIM5->DIER;
  state.sr = TIM5->SR;
  state.ccmr1 = TIM5->CCMR1;
  state.ccmr2 = TIM5->CCMR2;
  state.ccer = TIM5->CCER;
  state.cnt = TIM5->CNT;
  state.psc = TIM5->PSC;
  state.arr = TIM5->ARR;
  state.ccr1 = TIM5->CCR1;
  state.ccr2 = TIM5->CCR2;
  state.ccr3 = TIM5->CCR3;
  state.ccr4 = TIM5->CCR4;
  state.dcr = TIM5->DCR;
  state.dmar = TIM5->DMAR;
  state.option_register = TIM5->OR;
  return state;
}

void restore_tim5_state(const Tim5State& state) {
  TIM5->CR1 = 0;
  TIM5->DIER = 0;
  TIM5->CCER = 0;
  TIM5->CR2 = state.cr2;
  TIM5->SMCR = state.smcr;
  TIM5->CCMR1 = state.ccmr1;
  TIM5->CCMR2 = state.ccmr2;
  TIM5->CNT = state.cnt;
  TIM5->PSC = state.psc;
  TIM5->ARR = state.arr;
  TIM5->CCR1 = state.ccr1;
  TIM5->CCR2 = state.ccr2;
  TIM5->CCR3 = state.ccr3;
  TIM5->CCR4 = state.ccr4;
  TIM5->DCR = state.dcr;
  TIM5->DMAR = state.dmar;
  TIM5->OR = state.option_register;
  TIM5->SR = state.sr;
  TIM5->DIER = state.dier;
  TIM5->CCER = state.ccer;
  TIM5->CR1 = state.cr1;
  if(!state.clock_was_enabled) __HAL_RCC_TIM5_CLK_DISABLE();
}

bool measure_lsi_with_tim5(u32& frequency_hz) {
  const Tim5State saved = save_tim5_state();
  const u32 timer_clock_hz =
      stm32f4_platform_resources::apb1_timer_clock_hz();

  TIM5->CR1 = 0;
  TIM5->CR2 = 0;
  TIM5->SMCR = 0;
  TIM5->DIER = 0;
  TIM5->CCER = 0;
  TIM5->CCMR1 = 0;
  TIM5->CCMR2 = TIM_CCMR2_CC4S_0 | TIM_CCMR2_IC4PSC;
  TIM5->PSC = 0;
  TIM5->ARR = 0xFFFFFFFFUL;
  TIM5->CNT = 0;
  TIM5->OR = (saved.option_register & ~TIM_OR_TI4_RMP) |
             TIM_OR_TI4_RMP_0;
  TIM5->CCER = TIM_CCER_CC4E;
  TIM5->EGR = TIM_EGR_UG;
  TIM5->SR = 0;
  TIM5->CR1 = TIM_CR1_CEN;

  const u32 started_ms = millis();
  u32 first_capture = 0;
  u32 last_capture = 0;
  bool captured = true;
  for(u32 index = 0; index <= LSI_CAPTURE_INTERVALS; index++) {
    while((TIM5->SR & TIM_SR_CC4IF) == 0) {
      if((u32) (millis() - started_ms) >= LSI_CAPTURE_TIMEOUT_MS) {
        captured = false;
        break;
      }
    }
    if(!captured) break;

    const u32 status = TIM5->SR;
    const u32 value = TIM5->CCR4;
    TIM5->SR = 0;
    if((status & TIM_SR_CC4OF) != 0) {
      captured = false;
      break;
    }
    if(index == 0) first_capture = value;
    last_capture = value;
  }

  TIM5->CR1 = 0;
  const u32 timer_ticks = last_capture - first_capture;
  restore_tim5_state(saved);
  if(!captured ||
     !captured_frequency_hz(timer_clock_hz, LSI_CAPTURE_CYCLES,
                            timer_ticks, frequency_hz)) {
    return false;
  }
  return frequency_hz >= LSI_MIN_PLAUSIBLE_HZ &&
         frequency_hz <= LSI_MAX_PLAUSIBLE_HZ;
}

#endif

bool measured_lsi_prescalers(Prescalers& prescalers, u32& frequency_hz) {
  if(!start_lsi_for_measurement()) return false;
#if MK61_RTC_TIM5_LSI_CAPTURE
  return measure_lsi_with_tim5(frequency_hz) &&
         prescalers_for_frequency(frequency_hz, prescalers);
#else
  (void) prescalers;
  (void) frequency_hz;
  return false;
#endif
}

bool lse_gpio_is_released(void) {
  return (RCC->BDCR & RCC_BDCR_LSEON) == 0 &&
         __HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) == RESET;
}

bool hardware_uses_clock_source(ClockSource source) {
  const u32 selected = __HAL_RCC_GET_RTC_SOURCE();
  return selected == (source == ClockSource::LSE
      ? RCC_RTCCLKSOURCE_LSE
      : RCC_RTCCLKSOURCE_LSI);
}

bool disable_retained_lse_for_gpio(void) {
  if(MK61_RTC_LSE_AVAILABLE) return true;

  enableBackupDomain();
  const bool was_enabled = (RCC->BDCR & RCC_BDCR_LSEON) != 0;
  if(retained_lse_must_be_disabled(MK61_RTC_LSE_AVAILABLE, was_enabled)) {
    dbgln(SPIROM, "RTC init: disabling retained LSE to release PC15");
  }

  // LSEON находится в домене резервного питания и сохраняется при обычном
  // сбросе МК и перепрошивке. HAL STM32F4 сохраняет его даже при переключении
  // RTCSEL на LSI, поэтому OSC32_OUT остаётся недоступным как DB7 ЖКИ, пока мы
  // явно не сбросим этот бит.
  __HAL_RCC_LSE_CONFIG(RCC_LSE_OFF);
  if(wait_for_lse_flag(false, LSE_STOP_TIMEOUT_MS)) {
    dbgln(SPIROM, "RTC init: LSE off, PC15 released");
    return true;
  }

  // Зависшая конфигурация домена резервного питания не должна навсегда лишать
  // устройство дисплея. Это восстановление выполняется только после неудачной
  // штатной остановки LSE; календарь RTC всё равно непригоден, пока его тактовый
  // генератор невозможно остановить.
  dbgln(SPIROM, "RTC init: LSE stop timed out, resetting backup domain");
  __HAL_RCC_BACKUPRESET_FORCE();
  __HAL_RCC_BACKUPRESET_RELEASE();
  const bool stopped = wait_for_lse_flag(false, LSE_STOP_TIMEOUT_MS);
  if(stopped) dbgln(SPIROM, "RTC init: LSE off after backup reset");
  return stopped;
}

bool start_lse_without_fatal_handler(void) {
  if(!MK61_RTC_LSE_AVAILABLE) return false;

  // enableClock(LSE_CLOCK) из STM32duino вызывает Error_Handler(), если кварц
  // не запускается. Поэтому предварительно проверяем генератор сами, используя
  // устойчивый к переполнению тайм-аут, и обращаемся к STM32RTC лишь после того,
  // как LSERDY гарантированно установился.
  enableBackupDomain();
  if(__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) != RESET) return true;

#if defined(__HAL_RCC_LSEDRIVE_CONFIG) && defined(RCC_LSEDRIVE_LOW)
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);
#endif
  __HAL_RCC_LSE_CONFIG(RCC_LSE_ON);
  if(!wait_for_lse_flag(true, LSE_TIMEOUT_MS)) {
    __HAL_RCC_LSE_CONFIG(RCC_LSE_OFF);
    return false;
  }
  return true;
}

bool apply_measured_prescalers(const Prescalers& prescalers) {
  RTC_HandleTypeDef* const handle = rtc_handle();
  const u32 desired =
      ((u32) prescalers.asynchronous << RTC_PRER_PREDIV_A_Pos) |
      prescalers.synchronous;
  const u32 mask = RTC_PRER_PREDIV_A | RTC_PRER_PREDIV_S;
  handle->Init.AsynchPrediv = prescalers.asynchronous;
  handle->Init.SynchPrediv = prescalers.synchronous;
  if((handle->Instance->PRER & mask) == desired) return true;

  // STM32RTC intentionally leaves PRER untouched when an already initialized
  // RTC keeps the same source.  Update only PRER in RTC init mode so the
  // retained calendar, alarms and backup registers survive a normal reboot.
  __HAL_RTC_WRITEPROTECTION_DISABLE(handle);
  HAL_StatusTypeDef status = RTC_EnterInitMode(handle);
  if(status == HAL_OK) {
    handle->Instance->PRER = desired;
  }
  const HAL_StatusTypeDef exit_status = RTC_ExitInitMode(handle);
  if(status == HAL_OK) status = exit_status;
  __HAL_RTC_WRITEPROTECTION_ENABLE(handle);
  return status == HAL_OK &&
         (handle->Instance->PRER & mask) == desired;
}

bool begin_with_clock_source(ClockSource source,
                             const PreservedBackupState& backup,
                             const Prescalers* measured_prescalers) {
  STM32RTC& rtc = hardware_rtc();
  if(source == ClockSource::LSI && measured_prescalers != nullptr) {
    rtc.setClockSource(STM32RTC::LSI_CLOCK,
                       measured_prescalers->asynchronous,
                       measured_prescalers->synchronous);
  } else {
    rtc.setClockSource(source == ClockSource::LSE
        ? STM32RTC::LSE_CLOCK
        : STM32RTC::LSI_CLOCK);
  }
  rtc.begin();
  const bool prescalers_applied = measured_prescalers == nullptr ||
      apply_measured_prescalers(*measured_prescalers);
  restore_backup_state(backup);
  return prescalers_applied;
}

} // анонимное пространство имён

