bolknote/MK61S_MINI/code/rtc_clock.cpp
bool prepare_display_gpio(void) {
  const bool released = disable_retained_lse_for_gpio();
  if(!released) {
    dbgln(SPIROM, "RTC init: WARNING, PC15 may remain owned by LSE");
  }
  return released;
}

void init(void) {
  if(initialized) return;
  dbgln(SPIROM, "RTC init: start");

  prepare_display_gpio();
  const bool lse_ready = start_lse_without_fatal_handler();
  const ClockSource source =
      select_clock_source(MK61_RTC_LSE_AVAILABLE, lse_ready);
  const PreservedBackupState backup = preserve_backup_state();
  Prescalers measured_prescalers = {};
  u32 measured_lsi_hz = 0;
  const bool lsi_measured = source == ClockSource::LSI &&
      measured_lsi_prescalers(measured_prescalers, measured_lsi_hz);
  if(source == ClockSource::LSI && !lsi_measured) {
    dbgln(SPIROM, "RTC init: WARNING, LSI measurement failed");
  }
  if(!begin_with_clock_source(source, backup,
       lsi_measured ? &measured_prescalers : nullptr)) {
    dbgln(SPIROM, "RTC init: WARNING, measured prescalers were not applied");
  }
  if(!MK61_RTC_LSE_AVAILABLE && !lse_gpio_is_released() &&
     !disable_retained_lse_for_gpio()) {
    dbgln(SPIROM, "RTC init: WARNING, LSE returned after selecting LSI");
  }
  if(!apply_smooth_calibration(stored_calibration_ppm())) {
    dbgln(SPIROM, "RTC init: WARNING, calibration was not applied");
  }
  initialized = true;
  initialize_metadata(backup);
  if(lsi_measured) {
    dbgln(SPIROM, "RTC init: LSI ", (isize) measured_lsi_hz,
          " Hz, prediv A=", (isize) measured_prescalers.asynchronous,
          ", S=", (isize) measured_prescalers.synchronous);
  }
  dbgln(SPIROM, "RTC init: ready, clock ",
        source == ClockSource::LSE ? "LSE" : "LSI");
}

bool is_set(void) {
  return initialized && marker_is_set();
}

bool read_clock_source(ClockSource& out) {
  if(!initialized) return false;
  if(hardware_uses_clock_source(ClockSource::LSE)) {
    out = ClockSource::LSE;
    return true;
  }
  if(hardware_uses_clock_source(ClockSource::LSI)) {
    out = ClockSource::LSI;
    return true;
  }
  return false;
}

i16 calibration_ppm(void) {
  return initialized ? stored_calibration_ppm() : 0;
}

bool set_calibration_ppm(i16 ppm) {
  if(!initialized || !calibration_ppm_is_valid(ppm)) return false;

  const u32 old_record =
      HAL_RTCEx_BKUPRead(rtc_handle(), RTC_BKP_DR3);
  const i16 old_ppm = stored_calibration_ppm();
  if(!apply_smooth_calibration(ppm)) return false;

  const u32 new_record = encode_calibration_record(ppm);
  write_backup_register(RTC_BKP_DR3, new_record);
  if(HAL_RTCEx_BKUPRead(rtc_handle(), RTC_BKP_DR3) == new_record) {
    return true;
  }

  write_backup_register(RTC_BKP_DR3, old_record);
  (void) apply_smooth_calibration(old_ppm);
  return false;
}

bool startup_snapshot(StartupSnapshot& out) {
  if(!initialized) return false;

  RTC_TimeTypeDef time = {};
  RTC_DateTypeDef date = {};
  RTC_HandleTypeDef* handle = rtc_handle();

  // STM32 требует вызвать GetTime, а затем GetDate для разблокировки теневых
  // регистров; такой порядок также даёт согласованный снимок календаря при
  // переходе через полночь.
  const HAL_StatusTypeDef time_status = HAL_RTC_GetTime(handle, &time, RTC_FORMAT_BIN);
  const HAL_StatusTypeDef date_status = HAL_RTC_GetDate(handle, &date, RTC_FORMAT_BIN);
  if(time_status != HAL_OK || date_status != HAL_OK) return false;

  const StartupSnapshot current = {
    {
      (u16) (2000 + date.Year),
      date.Month,
      date.Date,
      time.Hours,
      time.Minutes,
      time.Seconds
    },
    time.SubSeconds,
    time.SecondFraction,
    marker_is_set()
  };
  if(!is_valid(current)) return false;
  out = current;
  return true;
}

bool read(DateTime& out) {
  StartupSnapshot snapshot = {};
  if(!startup_snapshot(snapshot) || !snapshot.time_set) return false;
  out = snapshot.date_time;
  return true;
}

bool set(const DateTime& value) {
  if(!initialized || !is_valid(value)) return false;

  RTC_DateTypeDef date = {};
  date.Year = (u8) (value.year - 2000);
  date.Month = value.month;
  date.Date = value.day;
  date.WeekDay = weekday(value);

  RTC_TimeTypeDef time = {};
  time.Hours = value.hour;
  time.Minutes = value.minute;
  time.Seconds = value.second;
  time.TimeFormat = RTC_HOURFORMAT12_AM;
  time.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
  time.StoreOperation = RTC_STOREOPERATION_RESET;

  RTC_HandleTypeDef* handle = rtc_handle();
  write_marker(0);
  if(HAL_RTC_SetDate(handle, &date, RTC_FORMAT_BIN) != HAL_OK) return false;
  if(HAL_RTC_SetTime(handle, &time, RTC_FORMAT_BIN) != HAL_OK) return false;
  write_marker(TIME_SET_MARKER);
  if(!marker_is_set()) return false;
  rtc_backup_layout::Metadata metadata = {};
  if(!read_metadata(metadata)) {
    metadata = rtc_backup_layout::empty_metadata();
    metadata.boot_count = 1;
    metadata.reset_flags = crash_dump::boot_reset_flags();
    metadata.last_wake = rtc_backup_layout::WakeReason::RESET;
    metadata.previous_power_unstable =
        power_monitor::snapshot().previous_unstable;
    if(!write_metadata(metadata)) {
      dbgln(SPIROM, "RTC metadata: repair after date set failed");
    }
    return true;
  }
  if(!restore_scheduled_alarms(metadata, true)) {
    // Setting the calendar succeeded. A separately reported alarm-arm error
    // must not make the Date UI claim that the clock itself was rejected.
    dbgln(SPIROM, "RTC metadata: re-arm after date set failed");
  }
  return true;
}

bool schedule_alarm(AlarmId id, const Alarm& requested) {
  if(!initialized || !marker_is_set() ||
     !rtc_backup_layout::valid_alarm(requested) || !requested.enabled) {
    return false;
  }
  Alarm alarm = requested;
  if(alarm.repeat == Repeat::DAILY) {
    alarm.when.year = 2000;
    alarm.when.month = 1;
    alarm.when.day = 1;
  } else {
    StartupSnapshot now = {};
    if(!startup_snapshot(now) || !now.time_set ||
       compare_snapshot_to_alarm(now, alarm) >= 0) {
      return false;
    }
  }

  rtc_backup_layout::Metadata metadata = {};
  if(!read_metadata(metadata)) return false;
  const u8 index = alarm_index(id);
  const Alarm previous = metadata.alarms[index];
  metadata.alarms[index] = alarm;
  if(!write_metadata(metadata)) return false;
  if(arm_hardware_alarm(id, alarm)) return true;

  increment_alarm_arm_failures();
  metadata.alarms[index] = previous;
  (void) write_metadata(metadata);
  (void) arm_hardware_alarm(id, previous);
  return false;
}

bool schedule_after(AlarmId id, u32 seconds) {
  if(seconds == 0) return false;
  StartupSnapshot now = {};
  DateTime target = {};
  if(!startup_snapshot(now) || !now.time_set ||
     !rtc_backup_layout::add_seconds(now.date_time, seconds, target)) {
    return false;
  }
  return schedule_alarm(id, {true, Repeat::ONE_SHOT, target,
                              snapshot_milliseconds(now)});
}

bool cancel_alarm(AlarmId id) {
  if(!initialized) return false;
  rtc_backup_layout::Metadata metadata = {};
  if(!read_metadata(metadata)) return false;
  const u8 index = alarm_index(id);
  const Alarm previous = metadata.alarms[index];
  metadata.alarms[index] = rtc_backup_layout::disabled_alarm();
  if(!write_metadata(metadata)) return false;
  if(disable_hardware_alarm(id)) return true;

  increment_alarm_arm_failures();
  metadata.alarms[index] = previous;
  (void) write_metadata(metadata);
  (void) arm_hardware_alarm(id, previous);
  return false;
}

bool read_alarm(AlarmId id, Alarm& out) {
  if(!initialized) return false;
  rtc_backup_layout::Metadata metadata = {};
  if(!read_metadata(metadata)) return false;
  out = metadata.alarms[alarm_index(id)];
  return true;
}

bool backup_status(BackupStatus& out) {
  rtc_backup_layout::Metadata metadata = {};
  const bool valid = initialized && read_metadata(metadata);
  out.valid = valid;
  out.valid_at_boot = metadata_valid_at_boot;
  out.alarm_arm_failures = alarm_arm_failures;
  out.boot_count = valid ? metadata.boot_count : 0;
  out.reset_flags = valid ? metadata.reset_flags : 0;
  out.last_wake = valid ? metadata.last_wake : WakeReason::UNKNOWN;
  out.previous_power_unstable =
      valid && metadata.previous_power_unstable;
  return valid;
}

bool arm_stop_wakeup(u8 seconds) {
#if defined(RTC_CR_WUTE) && defined(RTC_WAKEUPCLOCK_RTCCLK_DIV16) && \
    defined(RTC_PRER_PREDIV_A) && defined(RTC_PRER_PREDIV_S)
  if(!initialized || seconds == 0 || seconds > 5) return false;
  RTC_HandleTypeDef* const handle = rtc_handle();
  if((handle->Instance->CR & RTC_CR_WUTE) != 0) return false;

  const u32 prescalers = handle->Instance->PRER;
  const u32 prediv_async =
      (prescalers & RTC_PRER_PREDIV_A) >> RTC_PRER_PREDIV_A_Pos;
  const u32 prediv_sync = prescalers & RTC_PRER_PREDIV_S;
  u16 counter = 0;
  if(!rtc_clock::stop_wakeup_counter(
       prediv_async, prediv_sync, seconds, counter)) {
    return false;
  }

  __HAL_RTC_WAKEUPTIMER_CLEAR_FLAG(handle, RTC_FLAG_WUTF);
  __HAL_RTC_WAKEUPTIMER_EXTI_CLEAR_FLAG();
  HAL_NVIC_ClearPendingIRQ(RTC_WKUP_IRQn);
  if(HAL_RTCEx_SetWakeUpTimer_IT(
       handle, counter, RTC_WAKEUPCLOCK_RTCCLK_DIV16) != HAL_OK) {
    return false;
  }
  HAL_NVIC_SetPriority(RTC_WKUP_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(RTC_WKUP_IRQn);
  return true;
#else
  (void) seconds;
  return false;
#endif
}

bool stop_wakeup_pending(void) {
#if defined(RTC_FLAG_WUTF)
  return __HAL_RTC_WAKEUPTIMER_GET_FLAG(
      rtc_handle(), RTC_FLAG_WUTF) != RESET;
#else
  return false;
#endif
}

bool alarm_wakeup_pending(void) {
#if defined(RTC_FLAG_ALRAF)
  RTC_HandleTypeDef* const handle = rtc_handle();
  if(__HAL_RTC_ALARM_GET_FLAG(handle, RTC_FLAG_ALRAF) != RESET) return true;
  #if defined(RTC_FLAG_ALRBF)
  if(__HAL_RTC_ALARM_GET_FLAG(handle, RTC_FLAG_ALRBF) != RESET) return true;
  #endif
#endif
  return false;
}

