bolknote/MK61S_MINI/code/rtc_clock.cpp
bool disarm_stop_wakeup(void) {
#if defined(RTC_CR_WUTE)
  RTC_HandleTypeDef* const handle = rtc_handle();
  const bool ok = (handle->Instance->CR & RTC_CR_WUTE) == 0 ||
      HAL_RTCEx_DeactivateWakeUpTimer(handle) == HAL_OK;
  __HAL_RTC_WAKEUPTIMER_CLEAR_FLAG(handle, RTC_FLAG_WUTF);
  __HAL_RTC_WAKEUPTIMER_EXTI_CLEAR_FLAG();
  HAL_NVIC_ClearPendingIRQ(RTC_WKUP_IRQn);
  return ok;
#else
  return false;
#endif
}

void poll(void) {
  const u32 irq_events = __atomic_exchange_n(
      &pending_alarm_irqs, 0, __ATOMIC_ACQ_REL);
  if(irq_events == 0) return;

  rtc_backup_layout::Metadata metadata = {};
  if(!read_metadata(metadata)) return;
  StartupSnapshot snapshot = {};
  const bool have_time = startup_snapshot(snapshot) && snapshot.time_set;
  bool metadata_changed = false;

  for(u8 index = 0; index < 2; index++) {
    const AlarmId id = index == 0 ? AlarmId::A : AlarmId::B;
    const u8 bit = (u8) alarm_event_bit(id);
    if((irq_events & bit) == 0) continue;
    Alarm& alarm = metadata.alarms[index];
    if(!alarm.enabled) continue;

    if(alarm.repeat == Repeat::ONE_SHOT) {
      if(!have_time) {
        __atomic_fetch_or(&pending_alarm_irqs, bit, __ATOMIC_RELEASE);
        continue;
      }
      // STM32 hardware compares only day-of-month and time. An absolute alarm
      // for a future month/year may therefore wake early; metadata filters that
      // monthly candidate without exposing a false event.
      if(!rtc_backup_layout::hardware_candidate_is_due(snapshot, alarm)) {
        continue;
      }
      (void) disable_hardware_alarm(id);
      alarm = rtc_backup_layout::disabled_alarm();
    }

    pending_alarm_events |= bit;
    metadata.last_wake = id == AlarmId::A
        ? WakeReason::ALARM_A : WakeReason::ALARM_B;
    metadata_changed = true;
  }
  if(metadata_changed && !write_metadata(metadata)) {
    dbgln(SPIROM, "RTC metadata: event commit failed");
  }
}

bool take_alarm_event(AlarmEvent& out) {
  if(pending_alarm_events == 0) return false;
  const u8 bit = (pending_alarm_events & 1U) != 0 ? 1U : 2U;
  pending_alarm_events &= (u8) ~bit;
  out.id = bit == 1 ? AlarmId::A : AlarmId::B;
  out.missed = (missed_alarm_events & bit) != 0;
  missed_alarm_events &= (u8) ~bit;
  out.observed = {0, 0, 0, 0, 0, 0};
  (void) read(out.observed);
  return true;
}

} // пространство имён rtc_clock
